IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM3_CONTROLSS_G3_EPWM3.xml
	<register id="CONTROLSS_G3_EPWM3_HRCNFG" acronym="CONTROLSS_G3_EPWM3_HRCNFG" offset="0x40" width="16" description="HRPWM Configuration Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="LINESEL" width="2" begin="15" end="14" resetval="0x0" description="Delay Line Selection Bits: Selects which of the 4 delay lines for a particular ePWM/EPWM module to send to CALIN for calibration." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="HRLOADB" width="2" begin="12" end="11" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPBHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPB_EQ [Translator Event CMPB-3]  " range="12 - 11" rwaccess="R/W"/> 
		<bitfield id="CTLMODEB" width="1" begin="10" end="10" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPBHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="10" rwaccess="R/W"/> 
		<bitfield id="EDGMODEB" width="2" begin="9" end="8" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPBHR]  10: MEP control of falling edge [CMPBHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SWAPAB" width="1" begin="7" end="7" resetval="0x0" description="Swap ePWM A &#38; B Output Signals  This bit enables the swapping of the A &#38; B signal outputs. The selection is as follows:   0: ePWMxA and ePWMxB outputs are unchanged.  1: ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA output." range="7" rwaccess="R/W"/> 
		<bitfield id="AUTOCONV" width="1" begin="6" end="6" resetval="0x0" description="Auto Convert Delay Line Value  Selects whether the fractional duty cycle/period/phase in the CMPAHR/TBPRDHR/TBPHSHR register is automatically scaled by the MEP scale factor in the HRMSTEP register or manually scaled by calculations in application software. The SFO library function automatically updates the HRMSTEP register with the appropriate MEP scale factor.   0: Automatic HRMSTEP scaling is disabled.  1: Automatic HRMSTEP scaling is enabled.  If application software is manually scaling the fractional duty cycle, or phase [i.e. software sets CMPAHR = [fraction[PWMduty * PWMperiod] * MEP Scale Factor]&#38;#60;&#38;#60;8 + 0x080 for duty cycle], then this mode must be disabled." range="6" rwaccess="R/W"/> 
		<bitfield id="SELOUTB" width="1" begin="5" end="5" resetval="0x0" description="EPWMxB Output Select Bit  This bit selects which signal is output on the ePWMxB channel output. The inversion will take the high resolution mode into account and the inverted signal will contain any high resolution modification. The inversion takes place as the last step in modifying the ePWMxB signal.   0: ePWMxB output is normal.  1: ePWMxB output is inverted version of ePWMxA signal." range="5" rwaccess="R/W"/> 
		<bitfield id="HRLOAD" width="2" begin="4" end="3" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPAHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPA_EQ [Translator Event CMPA-3]  " range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="CTLMODE" width="1" begin="2" end="2" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPAHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="2" rwaccess="R/W"/> 
		<bitfield id="EDGMODE" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPAHR]  10: MEP control of falling edge [CMPAHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_HRCNFG2" acronym="CONTROLSS_G3_EPWM3_HRCNFG2" offset="0x4E" width="16" description="HRPWM Configuration 2 Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities. Only 16 bit accesses are allowed for this register.  Debugger access in 32 bit mode may display incorrect values.">
		<bitfield id="NOBYPASS" width="1" begin="15" end="15" resetval="0x0" description="No Bypass Delay Line Update Bit: For internal test purposes, this bit disables the 1 SYSCLK cycle bypass before delay line is updated." range="15" rwaccess="R/W"/> 
		<bitfield id="DELLOADFRC" width="1" begin="14" end="14" resetval="0x0" description="Delay Line Load Software Force: For internal test purposes, software force generates a pulse which forces a delay line update [similar to PRD_eq/CNT_zero strobe]." range="14" rwaccess="R/W1TS"/> 
		<bitfield id="CTLMODEDBFED" width="2" begin="5" end="4" resetval="0x0" description="Shadow Mode Bit - selection should match DBCTL[LOADFEDMODE]  Selects the time event that loads the DBFEDHR shadow value into the active register.   00 Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01 Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10 Load on either CTR = Zero or CTR = PRD  11 Reserved" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="CTLMODEDBRED" width="2" begin="3" end="2" resetval="0x0" description="Shadow Mode Bit - selection should match DBCTL[LOADREDMODE]  Selects the time event that loads the DBREDHR shadow value into the active register.   00 Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01 Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10 Load on either CTR = Zero or CTR = PRD  11 Reserved" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="EDGMODEDB" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00 HRPWM capability is disabled [default on reset]  01 MEP control of rising edge [DBREDHR]  10 MEP control of falling edge [DBFEDHR]  11 MEP control of both edges [rising edge of DBREDHR or falling edge of DBFEDHR ]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_HRPCTL" acronym="CONTROLSS_G3_EPWM3_HRPCTL" offset="0x5A" width="16" description="High Resolution Period Control Register  [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="PWMSYNCSELX" width="3" begin="6" end="4" resetval="0x0" description="Extended selection bits for EPWMSYNCPER   000: EPWMSYNCPER is defined by PWMSYNCSEL - > default condition [compatible with previous EPWM versions]  001: Reserved  010: Reserved  011: Reserved  100: CTR = CMPC, Count direction Up  101: CTR = CMPC, Count direction Down  110: CTR = CMPD, Count direction Up  111: CTR = CMPD, Count direction Down" range="6 - 4" rwaccess="R/W"/> 
		<bitfield id="HRPSYNCE" width="1" begin="3" end="3" resetval="0x0" description="SYNC Enable Bit [TRSYNCE]/High Resolution Period SYNC Enable Bit [HRPSYNCE]" range="3" rwaccess="R/W"/> 
		<bitfield id="TBPHSHRLOADE" width="1" begin="2" end="2" resetval="0x0" description="TBPHSHR Load Enable  This bit allows you to synchronize ePWM modules with a high-resolution phase on a SYNCIN, TBCTL[SWFSYNC] or digital compare event. This allows for multiple ePWM modules operating at the same frequency to be phase aligned with high-resolution.   0: Disables synchronization of high-resolution phase on a SYNCIN, TBCTL[SWFSYNC] or digital compare event:  1: Synchronize the high-resolution phase on a SYNCIN, TBCTL[SWFSYNC] or digital comparator synchronization event. The phase is synchronized using the contents of the high-resolution phase TBPHSHR register. The TBCTL[PHSEN] bit which enables the loading of the TBCTR register with TBPHS register value on a SYNCIN or TBCTL[SWFSYNC] event works independently. However, users need to enable this bit also if they want to control phase in conjunction with the high-resolution period feature.  This bit and the TBCTL[PHSEN] bit must be set to 1 when high-resolution period is enabled for up-down count mode even if TBPHSHR = 0x0000. This bit does not need to be set when only high-resolution duty is enabled." range="2" rwaccess="R/W"/> 
		<bitfield id="PWMSYNCSEL" width="1" begin="1" end="1" resetval="0x0" description="PWMSYNC Source Select Bit: This bit selects the source for the EPWMSYNCPER signal that goes to the CMPSS and GPDAC:    0  CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]   1  CTR = zero: Time-base counter equal to zero [TBCTR = 0x00]" range="1" rwaccess="R/W"/> 
		<bitfield id="HRPE" width="1" begin="0" end="0" resetval="0x0" description="High Resolution Period Enable Bit   0: High resolution period feature disabled. In this mode the ePWM behaves as a Type 0 ePWM.  1: High resolution period enabled. In this mode the HRPWM module can control high-resolution of both the duty and frequency. When high-resolution period is enabled, TBCTL[CTRMODE] = 0,1 [down-count mode] is not supported." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_TRREM" acronym="CONTROLSS_G3_EPWM3_TRREM" offset="0x5C" width="16" description="HRPWM High Resolution Remainder Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="TRREM" width="11" begin="10" end="0" resetval="0x0" description="HRPWM Remainder Bits: This 11-bit value keeps track of the remainder portion of the HRPWM algorithm calculations. This value keeps track of the remainder portion of the HRPWM hardware calculations.  Notes:  1. The lower 8-bits of the TRREM register can be automatically initialized with the TBPHSHR value on a SYNCIN or TBCTL[SWFSYNC] event or DC event [if enabled]. The user can also write a value with the CPU.  2. Priority of TRREM register updates:      Sync [software or hardware] TBPHSHR copied to TRREM : Highest Priority     HRPWM Hardware [updates TRREM register]: Next priority      CPU Write To TRREM Register: Lowest Priority  3. Bit 10 of TRREM register is not used in asymmetrical mode. This bit can be forced to zero. TRREM will be initialized to 0x0 and 0x100 in Up and Up-down modes respectively. Asymmetrical Mode:                               TRREM[7:0] = TBPHSHR[15:8]                               TRREM[10,9,8] = 0,0,0 Symmetrical Mode:                               TRREM[7:0] = TBPHSHR[15:8]                               TRREM[10,9,8] = 0,0,1" range="10 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_GLDCTL" acronym="CONTROLSS_G3_EPWM3_GLDCTL" offset="0x68" width="16" description="Global PWM Load Control Register">
		<bitfield id="GLDCNT" width="3" begin="12" end="10" resetval="0x0" description="Global Load Strobe Counter Register  These bits indicate how many selected events have occurred:    000: No events  001: 1 event  010: 2 events  011: 3 events  100: 4 events  101: 5 events  110: 6 events  111: 7 events" range="12 - 10" rwaccess="R"/> 
		<bitfield id="GLDPRD" width="3" begin="9" end="7" resetval="0x0" description="Global Load Strobe Period Select Register  These bits select how many selected events need to occur before a load strobe is generated   000: Disable counter  001: Generate strobe on GLDCNT = 001 [1st event]  010: Generate strobe on GLDCNT = 010 [2nd event]  011: Generate strobe on GLDCNT = 011 [3rd event]  100: Generate strobe on GLDCNT = 011 [4th event]  101: Generate strobe on GLDCNT = 001 [5th event]  110: Generate strobe on GLDCNT = 010 [6th event]  111: Generate strobe on GLDCNT = 011 [7th event]" range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="OSHTMODE" width="1" begin="5" end="5" resetval="0x0" description="One Shot Load Mode Control Bit   0: One shot load mode is disabled and shadow to active loading happens continuously on all the chosen load strobes.  1: One shot mode is active. All load strobes are blocked until GLDCTL2[OSHTLD] is written with 1.   Note: One Shot mode can only be used with global shadow to active load mode enabled [GLDCTL[GLD]=1]" range="5" rwaccess="R/W"/> 
		<bitfield id="GLDMODE" width="4" begin="4" end="1" resetval="0x0" description="Global Load Pulse selection for Shadow to Active Mode Reloads   0000: Load on Counter = 0 [CNT_ZRO]  0001: Load on Counter = Period [PRD_EQ]  0010: Load on either Counter = 0, or Counter = Period  0011: Load on SYNCEVT - this is logical OR of DCAEVT1.sync, DCBEVT1.sync, EPWMxSYNCI and TBCTL[SWFSYNC]  0100: Load on SYNCEVT or CNT_ZRO  0101: Load on SYNCEVT or PRD_EQ  0110: Load on SYNCEVT or CNT_ZRO or PRD_EQ  1000: Load on Counter = CMPCU [CMPC_EQ counter incrementing]  1001: Load on Counter = CMPCD [CMPC_EQ counter decrementing]  1010: Load on Counter = CMPDU [CMPD_EQ counter incrementing]  1011: Load on Counter = CMPDD [CMPD_EQ counter decrementing]  1100: Reserved  ...  1110: Reserved  1111: Load on GLDCTL2[GFRCLD] write" range="4 - 1" rwaccess="R/W"/> 
		<bitfield id="GLD" width="1" begin="0" end="0" resetval="0x0" description="Global Shadow to Active Load Event Control   0: Shadow to active reload for all shadowed registers happens as per the individual reload control bits specified [Compatible with previous EPWM versions].   1: When set, all the shadow to active reload events are defined by GLDMODE bits in GLDCTL register. All the shadow registers use same reload pulse from shadow to active reloading. Individual LOADMODE bits are ignored." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_GLDCFG" acronym="CONTROLSS_G3_EPWM3_GLDCFG" offset="0x6A" width="16" description="Global PWM Load Config Register ">
		<bitfield id="AQCSFRC" width="1" begin="10" end="10" resetval="0x0" description="Global load event configuration for AQCSFRC   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="10" rwaccess="R/W"/> 
		<bitfield id="AQCTLB_AQCTLB2" width="1" begin="9" end="9" resetval="0x0" description="Global load event configuration for AQCTLB_AQCTLB2   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="9" rwaccess="R/W"/> 
		<bitfield id="AQCTLA_AQCTLA2" width="1" begin="8" end="8" resetval="0x0" description="Global load event configuration for AQCTLA_AQCTLA2   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="8" rwaccess="R/W"/> 
		<bitfield id="DBCTL" width="1" begin="7" end="7" resetval="0x0" description="Global load event configuration for DBCTL   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="7" rwaccess="R/W"/> 
		<bitfield id="DBFED_DBFEDHR" width="1" begin="6" end="6" resetval="0x0" description="Global load event configuration for DBFED_DBFEDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="6" rwaccess="R/W"/> 
		<bitfield id="DBRED_DBREDHR" width="1" begin="5" end="5" resetval="0x0" description="Global load event configuration for DBRED_DBREDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="5" rwaccess="R/W"/> 
		<bitfield id="CMPD" width="1" begin="4" end="4" resetval="0x0" description="Global load event configuration for CMPD   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="4" rwaccess="R/W"/> 
		<bitfield id="CMPC" width="1" begin="3" end="3" resetval="0x0" description="Global load event configuration for CMPC   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="3" rwaccess="R/W"/> 
		<bitfield id="CMPB_CMPBHR" width="1" begin="2" end="2" resetval="0x0" description="Global load event configuration for CMPB_CMPBHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="2" rwaccess="R/W"/> 
		<bitfield id="CMPA_CMPAHR" width="1" begin="1" end="1" resetval="0x0" description="Global load event configuration for CMPA_CMPAHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="1" rwaccess="R/W"/> 
		<bitfield id="TBPRD_TBPRDHR" width="1" begin="0" end="0" resetval="0x0" description="Global load event configuration for TBPRD_TBPRDHR   0: Registers use local reload configuration even if GLDCTL[GLD]=1 [reload is compatible with previous EPWMs]  1: Registers use global load configuration if this bit is set and GLDCTL[GLD]=1" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_EPWMXLINK" acronym="CONTROLSS_G3_EPWM3_EPWMXLINK" offset="0x70" width="32" description="EPWMx Link Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="GLDCTL2LINK" width="5" begin="30" end="26" resetval="0x0" description="GLDCTL2 Link Bits  Writes to the GLDCTL2 registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's GLDCTL2 registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="30 - 26" rwaccess="R/W"/> 
		<bitfield id="CMPDLINK" width="5" begin="25" end="21" resetval="0x0" description="CMPD Link Bits  Writes to the CMPD registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPD registers.    00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="25 - 21" rwaccess="R/W"/> 
		<bitfield id="CMPCLINK" width="5" begin="20" end="16" resetval="0x0" description="CMPC Link Bits  Writes to the CMPC registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPC registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CMPBLINK" width="5" begin="14" end="10" resetval="0x0" description="CMPB_CMPBHR Link Bits  Writes to the CMPB_CMPBHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPB_CMPBHR registers.     00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="14 - 10" rwaccess="R/W"/> 
		<bitfield id="CMPALINK" width="5" begin="9" end="5" resetval="0x0" description="CMPA_CMPAHR Link Bits  Writes to the CMPA_CMPAHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's CMPA_CMPAHR registers.     00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="TBPRDLINK" width="5" begin="4" end="0" resetval="0x0" description="TBPRD_TBPRDHR Link Bits  Writes to the TBPRD:TBPRDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's TBPRD_TBPRDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_EPWMXLINK2" acronym="CONTROLSS_G3_EPWM3_EPWMXLINK2" offset="0x74" width="32" description="EPWMx Link 2 Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="DBFEDLINK" width="5" begin="9" end="5" resetval="0x0" description="DBFED_DBFEDHR Link Bits  Writes to the DBFED:DBFEDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBFED_DBFEDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="DBREDLINK" width="5" begin="4" end="0" resetval="0x0" description="DBRED_DBREDHR Link Bits  Writes to the DBRED:DBREDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBRED_DBREDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_ETEST" acronym="CONTROLSS_G3_EPWM3_ETEST" offset="0x7A" width="16" description="EPWM Test Register">
		<bitfield id="CMPFIX_OVERRIDE" width="1" begin="0" end="0" resetval="0x1" description="0: Bug fix overriden 1: Bug fix takes effect" range="0" rwaccess="R/W"/>
	</register>
