IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM3_CONTROLSS_G3_EPWM3.xml
	<register id="CONTROLSS_G3_EPWM3_DCFOFFSETCNT" acronym="CONTROLSS_G3_EPWM3_DCFOFFSETCNT" offset="0x194" width="16" description="Digital Compare Filter Offset Counter Register">
		<bitfield id="DCFOFFSETCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Offset Counter  These 16-bits are read only and indicate the current value of the offset counter. The counter counts down to zero and then stops until it is re-loaded on the next period or zero event as defined by the DCFCTL[PULSESEL] bit. The offset counter is not affected by the free/soft emulation bits. That is, it will always continue to count down if the device is halted by a emulation stop." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCFWINDOW" acronym="CONTROLSS_G3_EPWM3_DCFWINDOW" offset="0x196" width="16" description="Digital Compare Filter Window Register">
		<bitfield id="DCFWINDOW" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Width   00h: No blanking window is generated.  01-FFFFh: Specifies the width of the blanking window in TBCLK cycles. The blanking window begins when the offset counter expires. When this occurs, the window counter is loaded and begins to count down. If the blanking window is currently active and the offset counter expires, the blanking window counter is not restarted and the blanking window is cut short prematurely. Care should be taken to avoid this situation. The blanking window can cross a PWM period boundary." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCFWINDOWCNT" acronym="CONTROLSS_G3_EPWM3_DCFWINDOWCNT" offset="0x198" width="16" description="Digital Compare Filter Window Counter Register">
		<bitfield id="DCFWINDOWCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Counter  These 16 bits are read only and indicate the current value of the window counter. The counter counts down to zero and then stops until it is re-loaded when the offset counter reaches zero again." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_BLANKPULSEMIXSEL" acronym="CONTROLSS_G3_EPWM3_BLANKPULSEMIXSEL" offset="0x19A" width="16" description="Blanking window trigger pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [BLANKPULSEMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [BLANKPULSEMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [BLANKPULSEMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCCAPMIXSEL" acronym="CONTROLSS_G3_EPWM3_DCCAPMIXSEL" offset="0x19C" width="16" description="Capture Event pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [DCCAPMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [DCCAPMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [DCCAPMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCCAP" acronym="CONTROLSS_G3_EPWM3_DCCAP" offset="0x19E" width="16" description="Digital Compare Counter Capture Register ">
		<bitfield id="DCCAP" width="16" begin="15" end="0" resetval="0x0" description="Digital Compare Time-Base Counter Capture  To enable time-base counter capture, set the DCCAPCLT[CAPE] bit to 1. If enabled, reflects the value of the time-base counter [TBCTR] on the low to high edge transition of a filtered [DCEVTFLT] event. Further capture events are ignored until the next period or zero as selected by the DCFCTL[PULSESEL] bit. Shadowing of DCCAP is enabled and disabled by the DCCAPCTL[SHDWMODE] bit. By default this register is shadowed. - If DCCAPCTL[SHDWMODE] = 0, then the shadow is enabled. In this mode, the active register is copied to the shadow register on the TBCTR = TBPRD or TBCTR = zero as defined by the DCFCTL[PULSESEL] bit. CPU reads of this register will return the shadow register value. - If DCCAPCTL[SHDWMODE] = 1, then the shadow register is disabled. In this mode, CPU reads will return the active register value. The active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCAHTRIPSEL" acronym="CONTROLSS_G3_EPWM3_DCAHTRIPSEL" offset="0x1A4" width="16" description="Digital Compare AH Trip Select ">
		<bitfield id="TRIPINPUT15" width="1" begin="14" end="14" resetval="0x0" description="TRIP Input 15   0: Trip Input 15 not selected as combinational ORed input  1: Trip Input 15 selected as combinational ORed input to DCAH mux" range="14" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT14" width="1" begin="13" end="13" resetval="0x0" description="TRIP Input 14   0: Trip Input 14 not selected as combinational ORed input  1: Trip Input 14 selected as combinational ORed input to DCAH mux" range="13" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT13" width="1" begin="12" end="12" resetval="0x0" description="TRIP Input 13   0: Trip Input 13 not selected as combinational ORed input  1: Trip Input 13 selected as combinational ORed input to DCAH mux" range="12" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT12" width="1" begin="11" end="11" resetval="0x0" description="TRIP Input 12   0: Trip Input 12 not selected as combinational ORed input  1: Trip Input 12 selected as combinational ORed input to DCAH mux" range="11" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT11" width="1" begin="10" end="10" resetval="0x0" description="TRIP Input 11   0: Trip Input 11 not selected as combinational ORed input  1: Trip Input 11 selected as combinational ORed input to DCAH mux" range="10" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT10" width="1" begin="9" end="9" resetval="0x0" description="TRIP Input 10   0: Trip Input 10 not selected as combinational ORed input  1: Trip Input 10 selected as combinational ORed input to DCAH mux" range="9" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT9" width="1" begin="8" end="8" resetval="0x0" description="TRIP Input 9   0: Trip Input 9 not selected as combinational ORed input  1: Trip Input 9 selected as combinational ORed input to DCAH mux" range="8" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT8" width="1" begin="7" end="7" resetval="0x0" description="TRIP Input 8   0: Trip Input 8 not selected as combinational ORed input  1: Trip Input 8 selected as combinational ORed input to DCAH mux" range="7" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT7" width="1" begin="6" end="6" resetval="0x0" description="TRIP Input 7   0: Trip Input 7 not selected as combinational ORed input  1: Trip Input 7 selected as combinational ORed input to DCAH mux" range="6" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT6" width="1" begin="5" end="5" resetval="0x0" description="TRIP Input 6   0: Trip Input 6 not selected as combinational ORed input  1: Trip Input 6 selected as combinational ORed input to DCAH mux" range="5" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT5" width="1" begin="4" end="4" resetval="0x0" description="TRIP Input 5   0: Trip Input 5 not selected as combinational ORed input  1: Trip Input 5 selected as combinational ORed input to DCAH mux" range="4" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT4" width="1" begin="3" end="3" resetval="0x0" description="TRIP Input 4   0: Trip Input 4 not selected as combinational ORed input  1: Trip Input 4 selected as combinational ORed input to DCAH mux" range="3" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT3" width="1" begin="2" end="2" resetval="0x0" description="TRIP Input 3   0: Trip Input 3 not selected as combinational ORed input  1: Trip Input 3 selected as combinational ORed input to DCAH mux" range="2" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT2" width="1" begin="1" end="1" resetval="0x0" description="TRIP Input 2   0: Trip Input 2 not selected as combinational ORed input  1: Trip Input 2 selected as combinational ORed input to DCAH mux" range="1" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT1" width="1" begin="0" end="0" resetval="0x0" description="TRIP Input 1   0: Trip Input 1 not selected as combinational ORed input  1: Trip Input 1 selected as combinational ORed input to DCAH mux" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCALTRIPSEL" acronym="CONTROLSS_G3_EPWM3_DCALTRIPSEL" offset="0x1A6" width="16" description="Digital Compare AL Trip Select ">
		<bitfield id="TRIPINPUT15" width="1" begin="14" end="14" resetval="0x0" description="TRIP Input 15   0: Trip Input 15 not selected as combinational ORed input  1: Trip Input 15 selected as combinational ORed input to DCAL mux" range="14" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT14" width="1" begin="13" end="13" resetval="0x0" description="TRIP Input 14   0: Trip Input 14 not selected as combinational ORed input  1: Trip Input 14 selected as combinational ORed input to DCAL mux" range="13" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT13" width="1" begin="12" end="12" resetval="0x0" description="TRIP Input 13   0: Trip Input 13 not selected as combinational ORed input  1: Trip Input 13 selected as combinational ORed input to DCAL mux" range="12" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT12" width="1" begin="11" end="11" resetval="0x0" description="TRIP Input 12   0: Trip Input 12 not selected as combinational ORed input  1: Trip Input 12 selected as combinational ORed input to DCAL mux" range="11" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT11" width="1" begin="10" end="10" resetval="0x0" description="TRIP Input 11   0: Trip Input 11 not selected as combinational ORed input  1: Trip Input 11 selected as combinational ORed input to DCAL mux" range="10" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT10" width="1" begin="9" end="9" resetval="0x0" description="TRIP Input 10   0: Trip Input 10 not selected as combinational ORed input  1: Trip Input 10 selected as combinational ORed input to DCAL mux" range="9" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT9" width="1" begin="8" end="8" resetval="0x0" description="TRIP Input 9   0: Trip Input 9 not selected as combinational ORed input  1: Trip Input 9 selected as combinational ORed input to DCAL mux" range="8" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT8" width="1" begin="7" end="7" resetval="0x0" description="TRIP Input 8   0: Trip Input 8 not selected as combinational ORed input  1: Trip Input 8 selected as combinational ORed input to DCAL mux" range="7" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT7" width="1" begin="6" end="6" resetval="0x0" description="TRIP Input 7   0: Trip Input 7 not selected as combinational ORed input  1: Trip Input 7 selected as combinational ORed input to DCAL mux" range="6" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT6" width="1" begin="5" end="5" resetval="0x0" description="TRIP Input 6   0: Trip Input 6 not selected as combinational ORed input  1: Trip Input 6 selected as combinational ORed input to DCAL mux" range="5" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT5" width="1" begin="4" end="4" resetval="0x0" description="TRIP Input 5   0: Trip Input 5 not selected as combinational ORed input  1: Trip Input 5 selected as combinational ORed input to DCAL mux" range="4" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT4" width="1" begin="3" end="3" resetval="0x0" description="TRIP Input 4   0: Trip Input 4 not selected as combinational ORed input  1: Trip Input 4 selected as combinational ORed input to DCAL mux" range="3" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT3" width="1" begin="2" end="2" resetval="0x0" description="TRIP Input 3   0: Trip Input 3 not selected as combinational ORed input  1: Trip Input 3 selected as combinational ORed input to DCAL mux" range="2" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT2" width="1" begin="1" end="1" resetval="0x0" description="TRIP Input 2   0: Trip Input 2 not selected as combinational ORed input  1: Trip Input 2 selected as combinational ORed input to DCAL mux" range="1" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT1" width="1" begin="0" end="0" resetval="0x0" description="TRIP Input 1   0: Trip Input 1 not selected as combinational ORed input  1: Trip Input 1 selected as combinational ORed input to DCAL mux" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM3_DCBHTRIPSEL" acronym="CONTROLSS_G3_EPWM3_DCBHTRIPSEL" offset="0x1A8" width="16" description="Digital Compare BH Trip Select ">
		<bitfield id="TRIPINPUT15" width="1" begin="14" end="14" resetval="0x0" description="TRIP Input 15   0: Trip Input 15 not selected as combinational ORed input  1: Trip Input 15 selected as combinational ORed input to DCBH mux" range="14" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT14" width="1" begin="13" end="13" resetval="0x0" description="TRIP Input 14   0: Trip Input 14 not selected as combinational ORed input  1: Trip Input 14 selected as combinational ORed input to DCBH mux" range="13" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT13" width="1" begin="12" end="12" resetval="0x0" description="TRIP Input 13   0: Trip Input 13 not selected as combinational ORed input  1: Trip Input 13 selected as combinational ORed input to DCBH mux" range="12" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT12" width="1" begin="11" end="11" resetval="0x0" description="TRIP Input 12   0: Trip Input 12 not selected as combinational ORed input  1: Trip Input 12 selected as combinational ORed input to DCBH mux" range="11" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT11" width="1" begin="10" end="10" resetval="0x0" description="TRIP Input 11   0: Trip Input 11 not selected as combinational ORed input  1: Trip Input 11 selected as combinational ORed input to DCBH mux" range="10" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT10" width="1" begin="9" end="9" resetval="0x0" description="TRIP Input 10   0: Trip Input 10 not selected as combinational ORed input  1: Trip Input 10 selected as combinational ORed input to DCBH mux" range="9" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT9" width="1" begin="8" end="8" resetval="0x0" description="TRIP Input 9   0: Trip Input 9 not selected as combinational ORed input  1: Trip Input 9 selected as combinational ORed input to DCBH mux" range="8" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT8" width="1" begin="7" end="7" resetval="0x0" description="TRIP Input 8   0: Trip Input 8 not selected as combinational ORed input  1: Trip Input 8 selected as combinational ORed input to DCBH mux" range="7" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT7" width="1" begin="6" end="6" resetval="0x0" description="TRIP Input 7   0: Trip Input 7 not selected as combinational ORed input  1: Trip Input 7 selected as combinational ORed input to DCBH mux" range="6" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT6" width="1" begin="5" end="5" resetval="0x0" description="TRIP Input 6   0: Trip Input 6 not selected as combinational ORed input  1: Trip Input 6 selected as combinational ORed input to DCBH mux" range="5" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT5" width="1" begin="4" end="4" resetval="0x0" description="TRIP Input 5   0: Trip Input 5 not selected as combinational ORed input  1: Trip Input 5 selected as combinational ORed input to DCBH mux" range="4" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT4" width="1" begin="3" end="3" resetval="0x0" description="TRIP Input 4   0: Trip Input 4 not selected as combinational ORed input  1: Trip Input 4 selected as combinational ORed input to DCBH mux" range="3" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT3" width="1" begin="2" end="2" resetval="0x0" description="TRIP Input 3   0: Trip Input 3 not selected as combinational ORed input  1: Trip Input 3 selected as combinational ORed input to DCBH mux" range="2" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT2" width="1" begin="1" end="1" resetval="0x0" description="TRIP Input 2   0: Trip Input 2 not selected as combinational ORed input  1: Trip Input 2 selected as combinational ORed input to DCBH mux" range="1" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT1" width="1" begin="0" end="0" resetval="0x0" description="TRIP Input 1   0: Trip Input 1 not selected as combinational ORed input  1: Trip Input 1 selected as combinational ORed input to DCBH mux" range="0" rwaccess="R/W"/>
	</register>
